[{"title":"Choose Nissan","sub_title":"","description":"<p>Choose Nissan was a site done for <em>Nissan Canada<\/em> to feature their monthly specials. <em>Nissan<\/em>, like every other car company, has monthly specials split up into different regions. The west coast might have specials on trucks while Quebec might have specials on compacts. The user is automatically is directed to their region from a landing page where they must enter their postal code. Along with 5 different regions, one is in both English and French (can you guess what region that would be?)<\/p><p>It was relatively easy to accomplish with the <a href='\/category\/responsive'>responsiveness<\/a> using foundation and there wasn't much custom <a href='\/category\/javascript'>javascript<\/a> to do, besides the dealer locator. The site is built on <a href='\/category\/glovebox'>Glovebox<\/a> so most of the backend was already available, I just had to write a little bit of <a href='\/category\/php'>php<\/a> to get custom info from the <a href='\/category\/mysql'>database<\/a>. On top of the <a href='\/category\/html'>html<\/a> and <a href='\/category\/php'>php<\/a> there are a few tools written in python to populate certain content on the site.<\/p>","info":{"date":"15 June 2013","categories":["html","css","javascript","responsive","glovebox"],"client":"nissan","agency":"dashboard","agency_url":"http:\/\/www.dashboard.ca","url":"http:\/\/www.choosenissan.ca"},"slug":"choose-nissan"},{"title":"Fletchers","sub_title":"","description":"<p>The <em>Fletchers<\/em> site was for their brand launch in Canada. It was a relatively simple site to show off their products, create some tasty recipes and create BBQ tips for their BBQ leagues.<\/p><p>The site was built with foundation and built on <a href='\/category\/glovebox'>Glovebox<\/a>, and because of that it was a nice quick build with little problems. A difficulty I did encounter was in angled text in the big daddy, which I wanted used the `rotate` <a href='\/category\/css'>css<\/a> property so it would be able to be editable through <a href='\/category\/glovebox'>Glovebox<\/a>. In the end I found a happy medium between font size and position.<\/p>","info":{"date":"14 June 2013","categories":["html","css","javascript","responsive","glovebox"],"client":"Fletchers Fine Foods","agency":"dashboard","url":"http:\/\/www.fletchers.com"},"slug":"fletchers"},{"title":"The Orange Difference","sub_title":"","description":"<p>The Orange Difference was built for <em>ING Direct Canada<\/em> to create an online version of their public accountability pdf document. This site had to be built in <a href='\/category\/html'>html<\/a> so it could be ported to different servers easily. The static site mixed with the amount of content casued it to be a long tedious build. On top of all that it also had to be in English and French <\/p><p>Due to the uniqueness of the site, I could not use any frameworks so I really had to flex my brain muscles on how to achieve the transition effects, loading the content and switching from desktop to mobile. There were many hurdles in this site with some of the biggest ones being, the sheer amount of content, the blind transition effect, and the graceful transition to mobile.<\/p>","info":{"date":"1 June 2013","categories":["html","css","javascript","responsive","mobile"],"client":"ING Direct Canada","agency":"dashboard","agency_url":"http:\/\/www.dashboard.ca","url":"http:\/\/www.theorangedifference.ca"},"slug":"the-orange-difference"},{"title":"You Move Me","sub_title":"","description":"<p>This site was for the launch of the new brand <em>You Move Me<\/em>, located in both the US and Canada. This site had a lot of firsts for me which included, the first non automotive site built on <a href='\/category\/glovebox'>Glovebox<\/a>; the first site on <a href='\/category\/glovebox'>Glovebox<\/a> that needed a blog engine; the first time I used had used foundation <a href='\/category\/css'>css<\/a> framework; and the first time I had coded (a somewhat) <a href='\/category\/responsive'>responsive<\/a> layout. With their business model, the need for franchises to have their own site within the corporate site was needed to be built into <a href='\/category\/glovebox'>Glovebox<\/a>.<\/p><p>Since there were many new things with this site, there were many challenges with this site. I had to build  a blog engine into <a href='\/category\/glovebox'>Glovebox<\/a>, which mainly included creating a taxonomy schema and all the hooks for that into <a href='\/category\/glovebox'>Glovebox<\/a>. When it comes to the layout, the sidebar was the most difficult part of the front end. In the end I had to use some <a href='\/category\/javascript'>javascript<\/a> to manipulate the layout on document load (something that I cringe at the thought of but sometimes there’s no other way).<\/p>","info":{"date":"1 May 2013","categories":["html","css","javascript","responsive","php","mobile","glovebox"],"client":"You Move Me","agency":"dashboard","agency_url":"http:\/\/www.dashboard.ca","url":"http:\/\/www.youmoveme.com"},"slug":"you-move-me"},{"title":"Glovebox v2 Themes","sub_title":"","description":"<p>This is the second version of the themes that are used for dealers on the <a href='\/category\/glovebox'>Glovebox<\/a> system. In this second version of the themes the <a href='\/category\/css'>css<\/a> framework and how everything is structured was changed. With encorporating Foundation it gave us the <a href='category\/responsive'>responsivness<\/a> we wanted and with the custom <a href='category\/css'>sass<\/a> hiearchy I built, it gave us the ease of extending themes.<\/p><p>These were the first <a href='\/category\/responsive'>responsive<\/a> dealer sites on any system in Canada and it was no easy task. The hardest part to this build was definetly the navigation. I wanted to use the built in Foundation navigation but the <a href='\/category\/html'>html<\/a> structure was very limiting when creating the drop downs on the full sized site. With a lot of perseverance, patients and a little magic I found a solid solution and now it functions as was intended.<\/p>","info":{"date":"1 May 2013","categories":["html","css","javascript","responsive","java","glovebox"],"agency":"Glovebox","agency_url":"http:\/\/www.gloveboxcms.com"},"slug":"glovebox-v2-themes"},{"title":"Chatplode","sub_title":"","description":"<p><em>Chatplode<\/em> was a business venture that the client wanted to create to allow a user to upload an image and chat about it for up to 24 hours. The concept was very simple, and I had to do a little design work since a Theme Forest theme was provided. The difficult part was creating a production site built with <a href='\/category\/nodejs'>nodejs<a\/> and <a href='category\/mongodb'>mongodb<\/a><\/p><p>This was my first site that went into production that was built on <a href='\/category\/nodejs'>nodejs<a\/> + <a href='category\/mongodb'>mongodb<a\/>. On top of having to figure out how to push a <a href='\/category\/nodejs'>nodejs<\/a> live on a rackspace server (which I also setup for the client), I ended up writing my own chat application code from scratch. Yes I know there are a lot of frameworks available for this but it is something I always wanted to write, for some reason. Unfortunately the client has since taken the site down.<\/p>","info":{"date":"15 January 2013","categories":["html","css","javascript","nodejs","mongodb"]},"slug":"chatplode"},{"title":"Canadian Cars and Trucks","sub_title":"","description":"<p><em>Canadian Cars and Trucks<\/em> is a site that provides users with information about the vehicles and dealerships in Canada. Although this was a quick build, it was really fun creating the intricate filter and the dealer locator.<\/p><p>Since this site was built off code we already had, it allowed me to focus more on nuances and custom features around the site. This was the first (of many to follow ) Google maps locator widget. I always enjoy working with Google APIs because, for the most part, it is easy to figure out and get something up and running quickly. One of the hardest parts to the site to accomplish was the filter. It is present on every page so it had to maintain its state both from the page and query parameters. <\/p>","info":{"date":"1 September 2012","categories":["html","css","javascript","php"],"agency":"dashboard","agency_url":"http:\/\/www.dashboard.ca","url":"http:\/\/www.canadiancarsandtrucks.com"},"slug":"canadian-cars-and-trucks"},{"title":"Windsor Chamber of Commerce","sub_title":"","description":"<p><em>The Windsor Chamber of Commerce<\/em> site was for a group that represents various business in and around the Windsor, Ontario area. It was built on <a href='\/category\/wordpress'>wordpress<\/a> and also integrated Membee profiles and directories.<\/p><p>The most difficult part of this site BY FAR was integrating the Membee member info. It is a very old looking (and functioning) directory\/login utility that was extremely hard to use and just achieve simple pulls of information. Other than that it was a very standard <a href='\/category\/wordpress'>wordpress<\/a> build with using custom post types and multiple plug-ins to end up with a very sleek and speedy site experience.<\/p>","info":{"date":"1 April 2012","categories":["html","css","php","wordpress"],"client":"Windsor Chamber of Commerce","url":"http:\/\/www.windsorchamber.org\/"},"slug":"windsor-chamber-of-commerce"},{"title":"sc2Lounge","sub_title":"","description":"<p><em>SC2Lounge<\/em> was the first personal site I have made and launched (beside personal profile sites). When watching Starcraft 2 and e-sports videos on YouTube I often got very aggravated when the first out of a series would end and the next video would not automatically start. <em>SC2Lounge<\/em> was my solution, and after over a year of coding it and re coding it and recoding it, it launchedd.<\/p><p>I rewrote all of the code on this site 3 times before I was happy with how the code was written and how the site functioned. The most noticeable improvement were the benchmarks in updating process of the <a href='category\/mysql'>database<\/a>. I started off using <a href='\/category\/php'>php<\/a> to load the user data from YouTube and zend lucene to build the search index. The performance was fine for the first time around, however, once that virgin cloud lifted I started looking for another alternative. After doing a lot of research I decided that using <a href='\/category\/java'>java<\/a> and apache lucene was the best bet. The only problem was that I didn’t know <a href='\/category\/java'>java<\/a>. I took the time to learn the language, which was a lot like <a href='\/category\/actionscript+3'>Actionscript 3<\/a>, and after writing the script that did the same thing <a href='\/category\/php'>php<\/a> was doing, I couldn't have been happier with the results. There were amazing performance improvements when building of the search index. I actually got it working on the first try and I had to watch the directories to make sure it was working properly due to the speed. In indexing 20,000 database entries, <a href='\/category\/php'>php<\/a> took ~5 minutes while <a href='\/category\/java'>java<\/a> took ~9 seconds. No brainer right!<\/p>","info":{"date":"3 March 2012","categories":["html","css","javascript","java","php"],"url":"http:\/\/www.sc2lounge.com"},"slug":"sc2lounge"},{"title":"Winefox","sub_title":"","description":"<p>A new brand <em>Winefox<\/em>, was a site that was created to cater to wine connoisseurs to give them info about new wines. The site allowed users to read articles on wine, purchase wine and provide users with a pairing guide to match wines with food. This was a very complex wordpress build which had custom user logins, data pulls from various sources and a data matrix for the food to wine pairings.<\/p>","info":{"date":"15 September 2011","categories":["html","css","wordpress","php"],"client":"Torstar","agency":"dashboard","agency_url":"http:\/\/www.dashboard.ca"},"slug":"winefox"},{"title":"Glovebox v1 Themes","sub_title":"","description":"<p>These were the themes on the <em><a href='\/category\/glovebox'>Glovebox<\/a><\/em> system when it launched. When the first site launch on <a href='\/category\/glovebox'>Glovebox<\/a> in 2011, the web was just starting to really adopt the new standards in html5 and especially <a href='category\/css'>css3<\/a>. Because of this, all of these sites had images for everything that is now done with <a href='\/category\/css'>css<\/a>.<\/p><p>This was the largest project I have ever taken on. This was not only a standard front-end site build, it was also creating the backend hooks and then hooking everything together. These sites are 100% compatible down to IE7 (which we all know is super fun).  I had to also build a few jQuery plugins, as well as incorporate several more.<\/p>","info":{"date":"1 September 2011","categories":["html","css","javascript","php","mobile","glovebox"],"agency":"Glovebox","agency_url":"http:\/\/www.gloveboxcms.com"},"slug":"glovebox-v1-themes"},{"title":"The Grid TO","sub_title":"","description":"<p><em>The Grid<\/em> was a relaunch of the free magazine <em>`Eye Weekly`<\/em> in Toronto. This was, and still is, the largest site that I have ever worked on, in respect to the amount of views, amount of content and . The site was built on <a href='\/category\/wordpress'>wordpress<\/a> with buddypress integration for user profiles.<\/p>","info":{"date":"15 April 2011","categories":["html","css","javascript","wordpress","php"],"client":"Torstar","agency":"dashboard","agency_url":"http:\/\/www.dashboard.ca","url":"http:\/\/www.thegridto.com"},"slug":"the-grid-to"},{"title":"Rocscience","sub_title":"","description":"<p><em>Rocscience<\/em> is a software company that provides rock for engineers and educational purposes. This site has several products and a ton of content ranging from software info, news and events and product info. The site is compatible down to IE6, to the point where it looks almost identical to modern browsers. There are over 30 different templates on the site and it was my first project that I lead  the <a href='\/category\/html'>front end development<\/a>. This still looks and functions great and has really withstood the test of time.<\/p>","info":{"date":"1 June 2010","categories":["html","css","javascript"],"client":"Rocscience","agency":"dashboard","agency_url":"http:\/\/www.dashboard.ca","url":"http:\/\/www.rocscience.com"},"slug":"rocscience"},{"title":"Extra Money Giveaway","sub_title":"","description":"<p><em>The Extra Money Giveaway<\/em> was a mircosite developed for <em>H&R Block<\/em> as a fun way to give away money and free tax services. This site hasn't been up for a while now but it was one of my first full site builds I had ever done. The site was built using <a href='\/category\/actionscript+3'>flash<a\/> and <a href='\/category\/actionscipt+3'>papaervision 3d<\/a> in order to achieve the 3d floating. The most intertesting part that was done on this site was the reflection on the cubes. Papervision has a reflection class for the cubes but it did’t achieve the look that we were going for so I had to write my own. In the end I duplicated the image that was on the face of the cube on the fly, flipped it and created a gradient mask on the bottom from the bottom up.<\/p>","info":{"date":"05 March 2010","categories":["actionscript+3"],"client":"H&amp;R Block","agency":"dashboard","agency_url":"http:\/\/www.dashboard.ca"},"slug":"extra-money-giveaway"},{"title":"Filtrete 3d","sub_title":"","description":"<p><em>Filtrete<\/em> was a site created for <em>3M<\/em> to show off the efficiency furnace filters. This site was one of my first site I worked on at Dashboard and the amount I learnt on it was unbelievable. The coolest part of the site, was an awesome stereoscopic 3d adventure down a furnace grate to see all the creepy crawlers that exist. Another cool part to the site was the individual filter pages where different specs of `dust` would fly in from all angles and get stuck on the filters. This site won an FWA Site of the Day award, Applied Arts award and was featured in the stereoscopic edition of .Net Magazine.<\/p>","info":{"date":"15 September 2009","categories":["actionscript+3"],"client":"3M","agency":"dashboard","agency_url":"http:\/\/www.dashboard.ca","url":"http:\/\/www.filtrete3d.com\/filtrete\/App_Assets\/swf\/index_v2.swf"},"slug":"filtrete-3d"}]